{
  "backend/main.mo": "Motoko backend actor implementing authorization, blob storage, and admin-protected Meta WhatsApp API configuration, status checks, and user profile handling with HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report documenting logo generation and usage requirements, affected frontend files, dependent components, and test confidence.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of major frontend React components, pages, hooks, styles, and public assets for build and feature planning.",
  "frontend/index.css": "Global Tailwind CSS setup defining a full OKLCH-based design token system for light and dark themes, including layout, sidebar, and chart colors.",
  "frontend/index.html": "Base HTML entry point defining SEO meta tags, page title, and mounting the React app root.",
  "frontend/public/robots.txt": "Robots configuration allowing all crawlers and referencing the sitemap.xml file.",
  "frontend/public/sitemap.xml": "Static XML sitemap listing all public routes with priorities, change frequencies, and last modified dates.",
  "frontend/src/App.tsx": "Main React application entry configuring TanStack Router routes for all pages and wrapping the app in a theme provider.",
  "frontend/src/components/Footer.tsx": "Footer component rendering brand logo, company description, full contact details, navigation and legal links, using centralized brand constants.",
  "frontend/src/components/Header.tsx": "Implements a responsive site header with brand logo, navigation links, and conditional admin links based on Internet Identity and admin status, supporting both desktop and mobile menus.",
  "frontend/src/components/Layout.tsx": "Defines the main page layout with a persistent Header and Footer and an Outlet for routed page content.",
  "frontend/src/components/SEO.tsx": "Manages dynamic document title, meta tags, Open Graph/Twitter metadata, canonical links, and structured data for SEO using a React effect.",
  "frontend/src/constants/brand.ts": "Centralizes brand configuration including application name and logo asset metadata for consistent reuse across the frontend.",
  "frontend/src/hooks/useActor.ts": "Provides a React Query hook that creates and caches a backend actor based on the current Internet Identity, handling authentication, admin token initialization, and query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context and provider for Dfinity Internet Identity, exposing identity state, login/logout actions, and detailed login status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines a collection of React Query hooks for interacting with backend canister APIs, including contact forms, document uploads, admin checks, and WhatsApp messaging.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and defines a light/dark professional blue-themed design system using CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React application by rendering App with React Query and Internet Identity providers and loading global styles.",
  "frontend/src/pages/AboutPage.tsx": "Implements the public About Us page with SEO metadata, a hero section, company story, values, and milestones describing PB Partner Hub’s mission, vision, and growth.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Provides an admin-only dashboard with authentication, admin checks, searchable contact form submissions, CSV export, and login gating for non-authenticated users.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact Us page with SEO, contact information cards, and a contact form that submits inquiries via a mutation and shows success/error toasts.",
  "frontend/src/pages/DisclaimerPage.tsx": "Displays a legal disclaimer page with SEO metadata and structured sections outlining information accuracy, professional advice limitations, and liability disclaimers.",
  "frontend/src/pages/HomePage.tsx": "Defines the main landing page with SEO, hero section, core services, benefits, and calls to action linking to onboarding and services pages.",
  "frontend/src/pages/PartnerOnboardingPage.tsx": "Implements the partner onboarding UI for uploading required documents with drag-and-drop, document type selection, progress tracking, and batch upload to the backend using a custom upload hook.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a static Privacy Policy page with SEO metadata, structured sections, and legal content explaining data collection, usage, and protection.",
  "frontend/src/pages/ServicesPage.tsx": "Displays the Services page highlighting main services, additional support offerings, and agent support services with icons, descriptions, and SEO configuration.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Provides a static Terms of Use page with SEO metadata and detailed legal sections outlining user rights, licenses, and responsibilities.",
  "frontend/src/pages/WhatsAppDashboardPage.tsx": "Implements an admin-focused WhatsApp dashboard for viewing conversations, sending messages, managing Meta API configuration, monitoring integration/token/health status, and handling authentication and settings.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routes, persist them to sessionStorage, and retrieve or clear them safely. Includes logic to prioritize URL values, fall back to session state, and remove sensitive parameters from the hash without page reload.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining content scanning, dark-mode strategy, container defaults, and an extended theme using CSS-variable-driven colors, radii, shadows, and animations. Registers typography, container-queries, and animation plugins.",
  "project_state.json": "Machine-readable snapshot describing the PB Partner Hub project, including architecture, high-level summary, and versioned feature inventory. Used to track existing functionality such as the React SPA frontend, Tailwind-based UI system, Internet Identity auth, RBAC, and admin tooling."
}