{
  "backend/main.mo": "Main backend actor providing admin‑protected Meta API config management, phone‑number status checks via HTTP outcalls, user profile storage, and contact/document submission handling.",
  "backend/migration.mo": "Migration module that adds an approvedRecipients map with a default admin number while preserving existing metaApiConfig state.",
  "feature_evidence.json": "Feature evidence report mapping two WhatsApp‑related features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend pages, components, and hooks.",
  "frontend/index.css": "Tailwind CSS base with custom OKLCH color variables for light and dark themes across UI elements.",
  "frontend/index.html": "HTML entry point setting metadata for SEO and loading the React app via main.tsx.",
  "frontend/public/robots.txt": "Robots configuration allowing all crawlers and referencing the sitemap.",
  "frontend/public/sitemap.xml": "XML sitemap listing key site routes with last‑modified dates, priorities, and change frequencies.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages and wraps the app in a ThemeProvider.",
  "frontend/src/components/Footer.tsx": "Footer component showing brand info, contact details, and navigation links for company and legal pages.",
  "frontend/src/components/Header.tsx": "Responsive header component with navigation links, branding, and conditional admin actions using Internet Identity state.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that renders the header, footer, and routed page content.",
  "frontend/src/components/SEO.tsx": "Dynamic SEO helper that updates meta tags, canonical links, and structured data on mount.",
  "frontend/src/constants/brand.ts": "Centralized brand metadata including name and logo asset configuration.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider for managing Internet Identity login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for contact forms, document uploads, admin checks, and WhatsApp messaging.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining the application's color theme for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point configuring React Query, Internet Identity, global styles, and rendering the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, values, milestones, company overview, and SEO metadata.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Provides an admin dashboard with authentication, search, CSV export, and a table of contact form submissions.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact info and a form that submits inquiries via a mutation hook with success and error handling.",
  "frontend/src/pages/DisclaimerPage.tsx": "Shows a disclaimer page with structured sections detailing information use, warranties, and liabilities, plus SEO metadata.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero content, service features, benefits, navigation links, and SEO setup.",
  "frontend/src/pages/PartnerOnboardingPage.tsx": "Implements partner onboarding with document requirements, drag-and-drop uploads, type selection, and batch upload handling.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the privacy policy page with structured sections detailing data collection and usage.",
  "frontend/src/pages/ServicesPage.tsx": "Displays main, additional, and agent-support services with features, icons, and images.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Renders the terms of use page with sections on acceptance, licensing, and user responsibilities.",
  "frontend/src/pages/WhatsAppDashboardPage.tsx": "Provides an admin-focused WhatsApp messaging dashboard with message viewing, sending, configuration management, and recipient controls.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query or hash, persist them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores current project configuration and state, including domain setup notes, issues, existing features, and pending feature requests for PB Partners Hub."
}