{
  "backend/main.mo": "Motoko canister with admin‑protected Meta API config, WhatsApp number status check via HTTP outcalls, user profile storage, and document/contact form data structures.",
  "feature_evidence.json": "Feature evidence report listing Page 3 redesign, SEO, CTA, and visual‑theme work mapped to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend React files, pages, components, hooks, and assets.",
  "frontend/.gitignore": "Git ignore rules for node modules, builds, env files, IDE artifacts, Hostinger ZIP artifacts, and staging folders.",
  "frontend/HOSTINGER_ZIP_README.md": "Readme with instructions for building and deploying the frontend to Hostinger via ZIP.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH design tokens and light/dark theme variables.",
  "frontend/index.html": "Main HTML entrypoint defining metadata, canonical URL, favicon, and loading the React app.",
  "frontend/public/.htaccess": "Apache rewrite rules enabling SPA routing, compression, caching, and disabling directory browsing.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers and linking to sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing key site pages with lastmod, changefreq, and priority.",
  "frontend/scripts/build-hostinger-zip.mjs": "Node script that builds the frontend, injects .htaccess, and generates a Hostinger‑ready ZIP archive.",
  "frontend/src/App.tsx": "Sets up the app's routing using TanStack Router, defines all page routes, and wraps the router with a theme provider.",
  "frontend/src/components/chatbot/chatbotFlow.ts": "Defines chatbot intents, message types, quick replies, and a full conversation flow map for the chatbot.",
  "frontend/src/components/chatbot/ChatbotWidget.tsx": "Implements a floating chatbot widget with message flow, quick replies, and WhatsApp integration.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, contact details, and navigation links.",
  "frontend/src/components/Header.tsx": "Provides the site header with navigation, mobile menu, brand logo, and conditional admin links.",
  "frontend/src/components/HostingerZipDownloadLink.tsx": "Checks for availability of a Hostinger ZIP file and shows a download button or instructions if missing.",
  "frontend/src/components/Layout.tsx": "Defines the page layout including header, footer, main content outlet, chatbot widget, and WhatsApp button.",
  "frontend/src/components/SEO.tsx": "Dynamically updates document metadata, canonical links, and structured data for SEO.",
  "frontend/src/components/WhatsAppFloatingButton.tsx": "Displays a floating button that opens a pre-filled WhatsApp message.",
  "frontend/src/constants/brand.ts": "Provides brand metadata including name and logo configuration.",
  "frontend/src/constants/whatsapp.ts": "Defines WhatsApp phone number and a helper to build WhatsApp message URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context with login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for submitting forms, uploading documents, checking admin access, and managing WhatsApp data.",
  "frontend/src/index.css": "Sets global Tailwind styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission details, images, and SEO metadata.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard showing contact form submissions with search, CSV export, and authentication gating.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with fields, submission handling, and success/error toasts using a custom mutation hook. Includes SEO metadata and a styled layout.",
  "frontend/src/pages/DisclaimerPage.tsx": "Displays the site's disclaimer with structured sections inside cards and an alert. Includes SEO and static informational content.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, highlights list, and navigation links for partner onboarding and support. Includes SEO and an illustration.",
  "frontend/src/pages/InsuranceServicesPage.tsx": "Shows a grid of insurance services with icons, titles, and descriptions. Includes SEO and a structured services layout.",
  "frontend/src/pages/Page2Page.tsx": "Provides motor insurance service details, business info, and a hero section with calls to action. Includes SEO and multiple feature cards.",
  "frontend/src/pages/Page3Page.tsx": "Shows health insurance services, benefits, and business info with a hero section and CTA buttons. Includes SEO and structured feature cards.",
  "frontend/src/pages/Page4Page.tsx": "Placeholder page with basic text inside a card and SEO metadata. Designed for future customizable content.",
  "frontend/src/pages/Page5Page.tsx": "Simple placeholder page with SEO metadata and a card describing customizable content.",
  "frontend/src/pages/PartnerOnboardingPage.tsx": "Implements partner onboarding with document requirements, drag-and-drop uploads, file management, and upload handling logic.",
  "frontend/src/pages/PartnerSupportPage.tsx": "Displays partner support information, support service list, and links to contact and onboarding pages.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders a detailed privacy policy with multiple sections outlining data collection and usage.",
  "frontend/src/pages/ServicesPage.tsx": "Shows main, additional, and agent-specific services with icons, descriptions, and features.",
  "frontend/src/pages/TermsOfUsePage.tsx": "Displays terms of use content with sections covering acceptance, licensing, and account rules.",
  "frontend/src/pages/WhatsAppDashboardPage.tsx": "React page handling WhatsApp messaging, admin settings, recipient management, and integration status using multiple custom hooks and UI components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters and session storage values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, container settings, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state file tracking build progress, features, issues, and metadata for the Page 3 redesign initiative."
}