{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "WhatsApp dashboard: approved recipient number management + client-side send blocking",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add an admin UI in WhatsAppDashboardPage to view/add/remove approved WhatsApp recipient numbers (including approving 9168761915).",
      "acceptanceCriteria": [
        "In WhatsAppDashboardPage, an admin can add \"9168761915\" to the approved recipient list from the UI and see a success confirmation in English.",
        "The approved list is visible to admins and updates immediately after add/remove without requiring a full page refresh.",
        "An admin can remove an approved number from the list via the UI and see the list update accordingly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Extend the typed backend interface to include the new admin-only approved-recipient-number capabilities (list/add/remove) so the frontend can call them safely."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for approved WhatsApp recipient number management: fetch approved list, add number, remove number; ensure mutations invalidate/refetch the approved list query for immediate UI updates. (Uses core-infrastructure actor plumbing; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/WhatsAppDashboardPage.tsx",
          "operation": "modify",
          "description": "Add an \"Approved Recipients\" management section for admins: render the current approved list, provide an input to approve a new phone number (allow approving 9168761915), and add remove actions; show English success/error toasts; keep the list in sync via the new React Query hooks. (Uses shadcn-ui components already in the page; Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Block Meta API sends in the dashboard unless the selected recipient is approved; show an English error message when blocked and handle backend rejection gracefully.",
      "acceptanceCriteria": [
        "When attempting to send via Meta API to a recipient that is not approved, the backend rejects the request and the frontend shows an English error toast/message (no message is stored as delivered).",
        "When the recipient is approved (e.g., 9168761915), the Meta API send action proceeds (subject to existing connection/token checks) and the frontend shows the existing success toast on success."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the approved-recipient hooks expose enough state (approved list + loading/error) for the send flow to check approval before attempting the Meta API mutation; keep query keys consistent so invalidation updates send-blocking logic immediately. (Uses core-infrastructure actor plumbing; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/WhatsAppDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the Meta API send handler to enforce approved-recipient checks: if selectedContact is not in the approved list, do not call the send mutation and show an English error telling the admin to approve the number first; additionally, if the backend rejects the send due to approval/authorization, surface an English error toast/message and do not clear the message input."
        }
      ]
    }
  ]
}